[
    "http://contextus.net/ontology/ontomedia/core/space#",
    "http://contextus.net/ontology/ontomedia/ext/common/being#",
    "http://contextus.net/ontology/ontomedia/ext/common/trait#",
    "http://contextus.net/ontology/ontomedia/misc/date#",
    "http://contsem.unizar.es/def/sector-publico/pproc",
    "http://courseware.rkbexplorer.com/ontologies/courseware",
    "http://creativecommons.org/ns",
    "http://d-nb.info/standards/elementset/agrelon",
    "http://d-nb.info/standards/elementset/dnb",
    "http://data.archiveshub.ac.uk/def/",
    "http://data.ign.fr/def/geometrie",
    "http://data.ign.fr/def/topo",
    "http://data.lirmm.fr/ontologies/food",
    "http://data.lirmm.fr/ontologies/osp",
    "http://data.lirmm.fr/ontologies/passim",
    "http://data.lirmm.fr/ontologies/poste",
    "http://data.lirmm.fr/ontologies/vdpp",
    "http://data.ordnancesurvey.co.uk/ontology/50kGazetteer/",
    "http://data.ordnancesurvey.co.uk/ontology/admingeo/",
    "http://data.ordnancesurvey.co.uk/ontology/geometry/",
    "http://data.ordnancesurvey.co.uk/ontology/postcode/",
    "http://data.ordnancesurvey.co.uk/ontology/spatialrelations/",
    "http://data.press.net/ontology/asset/",
    "http://data.press.net/ontology/classification/",
    "http://data.press.net/ontology/event/",
    "http://data.press.net/ontology/identifier/",
    "http://data.press.net/ontology/stuff/",
    "http://data.press.net/ontology/tag/",
    "http://data.semanticweb.org/ns/swc/ontology",
    "http://data.totl.net/game/",
    "http://dati.camera.it/ocd/",
    "http://def.seegrid.csiro.au/isotc211/iso19108/2002/temporal",
    "http://def.seegrid.csiro.au/isotc211/iso19115/2003/dataquality",
    "http://def.seegrid.csiro.au/isotc211/iso19115/2003/extent",
    "http://def.seegrid.csiro.au/isotc211/iso19115/2003/lineage",
    "http://dev.poderopedia.com/vocab/schema",
    "http://elite.polito.it/ontologies/dogont.owl",
    "http://eprints.org/ontology/",
    "http://geovocab.org/geometry",
    "http://geovocab.org/spatial",
    "http://id.loc.gov/vocabulary/relators",
    "http://idi.fundacionctic.org/cruzar/turismo",
    "http://iflastandards.info/ns/fr/frad/",
    "http://iflastandards.info/ns/fr/frbr/frbrer/",
    "http://ns.inria.fr/semed/eduprogression/",
    "http://purl.oclc.org/NET/muo/ucum/",
    "http://purl.org/vocab/bio/0.1/",
    "http://purl.org/vocab/vann/",
    "http://qudt.org/schema/qudt",
    "http://schema.org/",
    "http://vocab.deri.ie/void",
    "http://www.aktors.org/ontology/portal",
    "http://www.opengis.net/ont/geosparql",
    "http://www.w3.org/2004/02/skos/core",
    "http://www.w3.org/ns/org#",
    "https://saref.etsi.org/core/",
    "https://saref.etsi.org/saref4envi/",
    "https://w3id.org/ep-plan",
    "https://w3id.org/vocab/sdm",
    "http://bag.basisregistraties.overheid.nl/def/bag",
    "http://erlangen-crm.org/current/",
    "http://inference-web.org/2.0/ds.owl",
    "http://inference-web.org/2.0/pml-provenance.owl",
    "http://iserve.kmi.open.ac.uk/ns/hrests",
    "http://iserve.kmi.open.ac.uk/ns/msm",
    "http://kdo.render-project.eu/kdo#",
    "http://kmi.open.ac.uk/projects/smartproducts/ontologies/food.owl",
    "http://lemon-model.net/lemon",
    "http://lexvo.org/ontology",
    "http://linkedevents.org/ontology/",
    "http://linkedscience.org/lsc/ns#",
    "http://linkedscience.org/teach/ns#",
    "http://lod.taxonconcept.org/ontology/sci_people.owl",
    "http://lod.taxonconcept.org/ontology/txn.owl",
    "http://loted.eu/ontology",
    "http://lsdis.cs.uga.edu/projects/semdis/opus#",
    "http://metadataregistry.org/uri/schema/RDARelationshipsGR2",
    "http://moat-project.org/ns#",
    "http://ndl.go.jp/dcndl/terms/",
    "http://ns.bergnet.org/tac/0.1/triple-access-control",
    "http://ns.cerise-project.nl/energy/def/cim-smartgrid",
    "http://ns.inria.fr/ast/sql#",
    "http://ns.inria.fr/nicetag/2010/09/09/voc",
    "http://ns.inria.fr/prissma/v2#",
    "http://ns.inria.fr/s4ac/v2",
    "http://ns.nature.com/terms/",
    "http://ogp.me/ns",
    "http://online-presence.net/opo/ns#",
    "http://ontology.it/itsmo/v1",
    "http://open-services.net/ns/asset#",
    "http://open-services.net/ns/core#",
    "http://open.vocab.org/terms",
    "http://openprovenance.org/model/opmo",
    "http://owlrep.eu01.aws.af.cm/fridge",
    "http://paul.staroch.name/thesis/SmartHomeWeather.owl#",
    "http://persistence.uni-leipzig.org/nlp2rdf/ontologies/nif-core#",
    "http://persistence.uni-leipzig.org/nlp2rdf/ontologies/rlog#",
    "http://privatealpha.com/ontology/certification/1#",
    "http://purl.obolibrary.org/obo/obi.owl",
    "http://purl.oclc.org/NET/ldr/ns#",
    "http://purl.oclc.org/NET/mvco.owl",
    "http://purl.oclc.org/NET/ssnx/cf/cf-feature",
    "http://purl.oclc.org/NET/ssnx/cf/cf-property",
    "http://purl.oclc.org/NET/ssnx/meteo/aws",
    "http://purl.oclc.org/NET/ssnx/qu/qu",
    "http://purl.org/acco/ns",
    "http://purl.org/archival/vocab/arch",
    "http://purl.org/biodiversity/taxon/",
    "http://purl.org/biotop/biotop.owl",
    "http://purl.org/cerif/frapo/",
    "http://purl.org/cld/cdtype/",
    "http://purl.org/cld/terms/",
    "http://purl.org/co",
    "http://purl.org/configurationontology",
    "http://purl.org/coo/ns#",
    "http://purl.org/ctic/dcat#",
    "http://purl.org/ctic/empleo/oferta",
    "http://purl.org/ctic/infraestructuras/localizacion",
    "http://purl.org/ctic/infraestructuras/organizacion",
    "http://purl.org/ctic/sector-publico/elecciones",
    "http://purl.org/dc/dcam/",
    "http://purl.org/dc/dcmitype/",
    "http://purl.org/dqm-vocabulary/v1/dqm",
    "http://purl.org/gen/0.1#",
    "http://purl.org/goodrelations/v1",
    "http://purl.org/healthcarevocab/v1",
    "http://purl.org/imbi/ru-meta.owl",
    "http://purl.org/innovation/ns",
    "http://purl.org/iso25964/skos-thes",
    "http://purl.org/library/",
    "http://purl.org/limo-ontology/limo/",
    "http://purl.org/LiMo/0.1#",
    "http://purl.org/linguistics/gold",
    "http://purl.org/linked-data/api/vocab#",
    "http://purl.org/linked-data/cube",
    "http://purl.org/linked-data/sdmx",
    "http://purl.org/linked-data/sdmx/2009/code",
    "http://purl.org/linked-data/sdmx/2009/dimension",
    "http://purl.org/linkingyou/",
    "http://purl.org/media",
    "http://purl.org/muto/core",
    "http://purl.org/NET/biol/botany#",
    "http://purl.org/NET/biol/ns#",
    "http://purl.org/NET/c4dm/event.owl",
    "http://purl.org/NET/c4dm/keys.owl",
    "http://purl.org/NET/c4dm/timeline.owl",
    "http://purl.org/net/lio",
    "http://purl.org/net/nknouf/ns/bibtex",
    "http://purl.org/net/ns/ex",
    "http://purl.org/net/ns/ontology-annot",
    "http://purl.org/net/opmv/ns#",
    "http://purl.org/net/p-plan#",
    "http://purl.org/net/provenance/ns#",
    "http://purl.org/net/provenance/types#",
    "http://purl.org/net/vocab/2004/03/label",
    "http://purl.org/net/wf-invocation",
    "http://purl.org/net/wf-motifs",
    "http://purl.org/ontology/af/",
    "http://purl.org/ontology/ao/core#",
    "http://purl.org/ontology/bibo/",
    "http://purl.org/ontology/cco/core#",
    "http://purl.org/ontology/chord/",
    "http://purl.org/ontology/co/core#",
    "http://purl.org/ontology/daia",
    "http://purl.org/ontology/dvia",
    "http://purl.org/ontology/is/core#",
    "http://purl.org/ontology/mo/",
    "http://purl.org/ontology/olo/core#",
    "http://purl.org/ontology/pbo/core#",
    "http://purl.org/ontology/places",
    "http://purl.org/ontology/po/",
    "http://purl.org/ontology/prv/core#",
    "http://purl.org/ontology/rec/core#",
    "http://purl.org/ontology/similarity/",
    "http://purl.org/ontology/ssso",
    "http://purl.org/ontology/stories/",
    "http://purl.org/ontology/storyline",
    "http://purl.org/ontology/wi/core#",
    "http://purl.org/ontology/wo/",
    "http://purl.org/ontology/wo/core#",
    "http://purl.org/opdm/refrigerator#",
    "http://purl.org/openorg/",
    "http://purl.org/pav/",
    "http://purl.org/procurement/public-contracts",
    "http://purl.org/rss/1.0",
    "http://purl.org/saws/ontology",
    "http://purl.org/spar/biro",
    "http://purl.org/spar/c4o",
    "http://purl.org/spar/cito",
    "http://purl.org/spar/datacite",
    "http://purl.org/spar/deo",
    "http://purl.org/spar/doco",
    "http://purl.org/spar/fabio",
    "http://purl.org/spar/pro",
    "http://purl.org/spar/pso",
    "http://purl.org/spar/pwo",
    "http://purl.org/spar/scoro/",
    "http://purl.org/stuff/rev#",
    "http://purl.org/swan/2.0/discourse-relationships/",
    "http://purl.org/theatre#",
    "http://purl.org/tio/ns#",
    "http://purl.org/twc/ontologies/cmo.owl",
    "http://purl.org/twc/ontology/cdm.owl#",
    "http://purl.org/twc/vocab/conversion/",
    "http://purl.org/uco/ns#",
    "http://purl.org/vocab/aiiso/schema",
    "http://purl.org/vocab/changeset/schema",
    "http://purl.org/vocab/frbr/core",
    "http://purl.org/vocab/frbr/extended",
    "http://purl.org/vocab/lifecycle/schema",
    "http://purl.org/vocab/participation/schema",
    "http://purl.org/vocab/relationship/",
    "http://purl.org/vso/ns",
    "http://purl.org/vvo/ns#",
    "http://purl.org/wai#",
    "http://purl.uniprot.org/core/",
    "http://rdaregistry.info/Elements/a",
    "http://rdaregistry.info/Elements/c",
    "http://rdaregistry.info/Elements/e",
    "http://rdaregistry.info/Elements/i",
    "http://rdaregistry.info/Elements/m",
    "http://rdaregistry.info/Elements/u",
    "http://rdaregistry.info/Elements/w",
    "http://rdf-vocabulary.ddialliance.org/discovery",
    "http://rdf-vocabulary.ddialliance.org/phdd",
    "http://rdf.geospecies.org/methods/observationMethod.rdf",
    "http://rdf.geospecies.org/ont/geospecies",
    "http://rdf.muninn-project.org/ontologies/appearances",
    "http://rdf.muninn-project.org/ontologies/military",
    "http://rdf.myexperiment.org/ontologies/base/",
    "http://rdf.myexperiment.org/ontologies/snarm/",
    "http://rdfs.co/bevon/",
    "http://rdfs.org/scot/ns#",
    "http://rdfs.org/sioc/ns#",
    "http://rdfs.org/sioc/types#",
    "http://rdfunit.aksw.org/ns/core#",
    "http://rdvocab.info/Elements",
    "http://rdvocab.info/ElementsGr2",
    "http://rdvocab.info/ElementsGr3",
    "http://rdvocab.info/RDARelationshipsWEMI",
    "http://rdvocab.info/roles",
    "http://rdvocab.info/uri/schema/FRBRentitiesRDA",
    "http://reference.data.gov.uk/def/central-government",
    "http://reference.data.gov.uk/def/intervals",
    "http://reference.data.gov.uk/def/organogram",
    "http://reference.data.gov.uk/def/parliament",
    "http://reference.data.gov.uk/def/payment#",
    "http://rhizomik.net/ontologies/copyrightonto.owl",
    "http://salt.semanticauthoring.org/ontologies/sao",
    "http://salt.semanticauthoring.org/ontologies/sdo",
    "http://salt.semanticauthoring.org/ontologies/sro",
    "http://schema.theodi.org/odrs",
    "http://securitytoolbox.appspot.com/MASO",
    "http://securitytoolbox.appspot.com/securityMain",
    "http://securitytoolbox.appspot.com/stac",
    "http://semanticscience.org/ontology/sio.owl",
    "http://semanticweb.cs.vu.nl/2009/11/sem/",
    "http://semweb.mmlab.be/ns/apps4X",
    "http://semweb.mmlab.be/ns/odapps",
    "http://simile.mit.edu/2003/10/ontologies/vraCore3#",
    "http://spi-fm.uca.es/spdef/models/deployment/spcm/1.0",
    "http://spi-fm.uca.es/spdef/models/deployment/swpm/1.0",
    "http://spi-fm.uca.es/spdef/models/genericTools/itm/1.0",
    "http://spi-fm.uca.es/spdef/models/genericTools/vmm/1.0",
    "http://spi-fm.uca.es/spdef/models/genericTools/wikim/1.0",
    "http://spinrdf.org/sp",
    "http://spinrdf.org/spin",
    "http://spitfire-project.eu/ontology/ns",
    "http://sw-portal.deri.org/ontologies/swportal",
    "http://swrc.ontoware.org/ontology-07",
    "http://umbel.org/umbel",
    "http://uri4uri.net/vocab",
    "http://usefulinc.com/ns/doap#",
    "http://vivoweb.org/ontology/core",
    "http://voag.linkedmodel.org/schema/voag",
    "http://vocab.data.gov/def/drm",
    "http://vocab.data.gov/def/fea",
    "http://vocab.data.gov/gd",
    "http://vocab.deri.ie/br",
    "http://vocab.deri.ie/c4n",
    "http://vocab.deri.ie/cogs",
    "http://vocab.deri.ie/csp",
    "http://vocab.deri.ie/dady",
    "http://vocab.deri.ie/odapp",
    "http://vocab.deri.ie/pdo",
    "http://vocab.deri.ie/ppo",
    "http://vocab.deri.ie/raul",
    "http://vocab.deri.ie/scovo",
    "http://vocab.deri.ie/scsv",
    "http://vocab.deri.ie/search",
    "http://vocab.deri.ie/tao",
    "http://vocab.gtfs.org/terms#",
    "http://vocab.lenka.no/geo-deling",
    "http://vocab.org/transit/terms/",
    "http://vocab.org/whisky/terms",
    "http://vocab.resc.info/communication",
    "http://vocab.sti2.at/vrank",
    "http://w3id.org/nfdi4ing/metadata4ing#",
    "http://www.agls.gov.au/agls/terms",
    "http://www.aktors.org/ontology/support",
    "http://www.ontologydesignpatterns.org/ont/dul/IOLite.owl",
    "http://www.ontologydesignpatterns.org/ont/dul/ontopic.owl",
    "http://www.ontologydesignpatterns.org/ont/lmm/LMM_L1.owl",
    "http://www.ontologydesignpatterns.org/ont/lmm/LMM_L2.owl",
    "http://www.ontologydesignpatterns.org/ont/web/irw.owl",
    "http://www.ontologydesignpatterns.org/schemas/cpannotationschema.owl",
    "http://www.ontotext.com/proton/protonext",
    "http://www.ontotext.com/proton/protontop",
    "http://www.openarchives.org/ore/terms/",
    "http://www.opengis.net/ont/gml",
    "http://www.opengis.net/ont/sf",
    "http://www.opmw.org/ontology/",
    "http://www.ordnancesurvey.co.uk/ontology/Topography/v0.1/Topography.owl",
    "http://www.purl.org/net/remetca#",
    "http://www.rkbexplorer.com/ontologies/acm",
    "http://www.samos.gr/ontologies/helpdeskOnto.owl",
    "http://www.semanticdesktop.org/ontologies/2007/01/19/nie",
    "http://www.semanticdesktop.org/ontologies/2007/03/22/nco",
    "http://www.semanticdesktop.org/ontologies/2007/03/22/nfo",
    "http://www.semanticdesktop.org/ontologies/2007/04/02/ncal",
    "http://www.semanticdesktop.org/ontologies/2007/08/15/nao",
    "http://www.semanticdesktop.org/ontologies/2007/08/15/nrl",
    "http://www.semanticweb.org/ontologies/2008/11/OntologySecurity.owl",
    "http://www.sensormeasurement.appspot.com/ont/transport/traffic",
    "http://www.tele.pw.edu.pl/~sims-onto/ConnectivityType.owl",
    "http://www.telegraphis.net/ontology/measurement/measurement#",
    "http://www.w3.org/1999/xhtml/vocab",
    "http://www.w3.org/2000/10/swap/log",
    "http://www.w3.org/2000/10/swap/pim/contact",
    "http://www.w3.org/2000/10/swap/pim/doc",
    "http://www.w3.org/2001/02pd/rec54#",
    "http://www.w3.org/2001/sw/hcls/ns/transmed/",
    "http://www.w3.org/2001/XMLSchema",
    "http://www.w3.org/2002/12/cal/ical",
    "http://www.w3.org/2003/01/geo/wgs84_pos",
    "http://www.w3.org/2003/11/swrl",
    "http://www.w3.org/2003/12/exif/ns",
    "http://www.w3.org/2003/g/data-view",
    "http://www.w3.org/2004/03/trix/swp-1",
    "http://www.w3.org/2004/09/fresnel",
    "http://www.w3.org/2006/03/test-description",
    "http://www.w3.org/2006/timezone",
    "http://www.w3.org/2007/05/powder-s",
    "http://www.w3.org/2007/uwa/context/deliverycontext.owl",
    "http://www.w3.org/2011/content",
    "http://www.w3.org/ns/auth/cert#",
    "http://www.w3.org/ns/csvw#",
    "http://www.w3.org/ns/dcat",
    "http://www.w3.org/ns/dx/prof",
    "http://www.w3.org/ns/earl",
    "http://www.w3.org/ns/hydra/core",
    "http://www.w3.org/ns/ldp#",
    "http://www.w3.org/ns/ma-ont",
    "http://www.w3.org/ns/mls",
    "http://www.w3.org/ns/radion#",
    "http://www.w3.org/ns/rdfa#",
    "http://www.w3.org/ns/rdftest",
    "http://www.w3.org/ns/shacl#",
    "http://www.w3.org/ns/solid/terms",
    "http://www.w3.org/ns/sparql-service-description",
    "http://www.w3.org/ns/ui",
    "http://www.w3.org/TR/2003/PR-owl-guide-20031209/wine",
    "http://www.w3.org/TR/2003/PR-owl-guide-20031215/food",
    "http://www.w3id.org/def/caso#",
    "http://www.w3id.org/urban-iot/core",
    "http://www.w3id.org/urban-iot/electric",
    "http://www.w3id.org/urban-iot/sharing",
    "http://www.wiwiss.fu-berlin.de/suhl/bizer/D2RQ/0.1",
    "http://www.wsmo.org/ns/wsmo-lite#",
    "http://xmlns.com/wot/0.1/",
    "http://zbw.eu/namespaces/zbw-extensions",
    "https://bmake.th-brandenburg.de/spv",
    "https://data.istex.fr/ontology/istex#",
    "https://data.nasa.gov/ontologies/atmonto/ATM#",
    "https://data.nasa.gov/ontologies/atmonto/data#",
    "https://data.nasa.gov/ontologies/atmonto/equipment#",
    "https://data.nasa.gov/ontologies/atmonto/general#",
    "https://data.nasa.gov/ontologies/atmonto/NAS#",
    "https://decision-ontology.googlecode.com/svn/trunk/decision.owl",
    "https://opendata.aragon.es/def/ei2a/ei2a.owl",
    "https://privatealpha.com/ontology/content-inventory/1#",
    "https://privatealpha.com/ontology/ibis/1#",
    "https://privatealpha.com/ontology/transformation/1#",
    "https://purl.org/esric/sronto",
    "https://raw.githubusercontent.com/airs-linked-data/lov/latest/src/airs_vocabulary.ttl#",
    "https://saref.etsi.org/saref4agri/",
    "https://saref.etsi.org/saref4bldg/",
    "https://saref.etsi.org/saref4city/",
    "https://saref.etsi.org/saref4ehaw/",
    "https://saref.etsi.org/saref4ener/",
    "https://saref.etsi.org/saref4inma/",
    "https://saref.etsi.org/saref4syst/",
    "https://saref.etsi.org/saref4watr/",
    "https://saref.etsi.org/saref4wear/",
    "https://schema.edu.ee/",
    "https://vocab.eccenca.com/pubsub/",
    "https://vocab.eccenca.com/revision/",
    "https://w3id.org/arco/ontology/arco",
    "https://w3id.org/arco/ontology/catalogue",
    "https://w3id.org/arco/ontology/context-description",
    "https://w3id.org/arco/ontology/core",
    "https://w3id.org/arco/ontology/cultural-event",
    "https://w3id.org/arco/ontology/denotative-description",
    "https://w3id.org/arco/ontology/location",
    "https://w3id.org/BCI-ontology",
    "https://w3id.org/bcom",
    "https://w3id.org/bot",
    "https://w3id.org/cdc",
    "https://w3id.org/cocoon/v1.0",
    "https://w3id.org/con-tax",
    "https://w3id.org/cto",
    "https://w3id.org/dba/ontology/",
    "https://w3id.org/dco",
    "https://w3id.org/dingo/",
    "https://w3id.org/dio",
    "https://w3id.org/dot#",
    "https://w3id.org/eeo",
    "https://w3id.org/eepsa",
    "https://w3id.org/fog",
    "https://w3id.org/GConsent",
    "https://w3id.org/GDPRov",
    "https://w3id.org/GDPRtEXT",
    "https://w3id.org/gom",
    "https://w3id.org/i40/aml",
    "https://w3id.org/i40/rami/",
    "https://w3id.org/i40/sto#",
    "https://w3id.org/ibp/CTRLont",
    "https://w3id.org/idsa/core",
    "https://w3id.org/ifc/IFC4_ADD1",
    "https://w3id.org/iot-tta/",
    "https://w3id.org/ldes",
    "https://w3id.org/mdo/calculation/",
    "https://w3id.org/mdo/core/",
    "https://w3id.org/mdo/full/",
    "https://w3id.org/mdo/provenance/",
    "https://w3id.org/mdo/structure/",
    "https://w3id.org/multidimensional-interface/ontology",
    "https://w3id.org/nno/ontology",
    "https://w3id.org/omg",
    "https://w3id.org/opentrafficlights",
    "https://w3id.org/opm",
    "https://w3id.org/pep/",
    "https://w3id.org/pfeepsa#",
    "https://w3id.org/rail/topo#",
    "https://w3id.org/rains",
    "https://w3id.org/rdfp/",
    "https://w3id.org/sao",
    "https://w3id.org/sbeo",
    "https://w3id.org/seas/",
    "https://w3id.org/seas/BatteryOntology",
    "https://w3id.org/seas/BuildingOntology",
    "https://w3id.org/seas/DeviceOntology",
    "https://w3id.org/seas/EvaluationOntology",
    "https://w3id.org/seas/FeatureOfInterestOntology",
    "https://w3id.org/seas/ForecastingOntology",
    "https://w3id.org/seas/OperatingOntology",
    "https://w3id.org/seas/QUDTAlignment",
    "https://w3id.org/seas/StatisticsOntology",
    "https://w3id.org/seas/SystemOntology",
    "https://w3id.org/seas/TimeOntology",
    "https://w3id.org/seas/TradingOntology",
    "https://w3id.org/seo#",
    "https://w3id.org/skgo/modsci#",
    "https://w3id.org/squap/",
    "https://w3id.org/timebank",
    "https://w3id.org/todo",
    "https://w3id.org/todo/tododfa",
    "https://w3id.org/todo/tododial",
    "https://w3id.org/todo/tododm",
    "https://w3id.org/todo/tododom",
    "https://w3id.org/todo/tododt",
    "https://w3id.org/todo/tododw",
    "https://w3id.org/tree",
    "https://w3id.org/usability",
    "https://w3id.org/vocab/lingvoj",
    "https://w3id.org/vocab/olca",
    "https://w3id.org/vocab/xbrll",
    "https://www.auto.tuwien.ac.at/downloads/thinkhome/ontology/WeatherOntology.owl",
    "https://www.gleif.org/ontology/Base/",
    "https://www.gleif.org/ontology/EntityLegalForm/",
    "https://www.gleif.org/ontology/Geocoding/",
    "https://www.gleif.org/ontology/L1/",
    "https://www.gleif.org/ontology/L2/",
    "https://www.gleif.org/ontology/RegistrationAuthority/",
    "https://www.gleif.org/ontology/ReportingException/",
    "https://www.ica.org/standards/RiC/ontology",
    "https://www.w3.org/2019/wot/hypermedia#",
    "https://www.w3.org/2019/wot/json-schema#",
    "https://www.w3.org/2019/wot/security#",
    "https://www.w3.org/2019/wot/td",
    "https://www.w3.org/ns/ssn",
    "https://www.w3id.org/survey-ontology",
    "https://yogaontology.org/ontology/",
    "http://www.w3.org/1999/02/22-rdf-syntax-ns#",
    "http://www.w3.org/2000/01/rdf-schema#",
    "http://xmlns.com/foaf/0.1/",
    "http://purl.org/dc/terms/",
    "http://purl.org/dc/elements/1.1/",
    "https://w3id.org/bot#",
    "http://pi.pauwel.be/voc/buildingelement",
    "http://pi.pauwel.be/voc/distributionelement",
    "http://pi.pauwel.be/voc/furniture",
    "https://mdcs.monumentenkennis.nl/damageatlas/ontology",
    "https://w3id.org/con-tax/aat-materials",
    "https://w3id.org/con-tax/components/aat-arch",
    "https://w3id.org/con-tax/components/aat-furn",
    "https://w3id.org/con-tax/components/aat-mep",
    "https://w3id.org/con-tax/damages/mwv",
    "https://w3id.org/con-tax/properties/bhp",
    "https://w3id.org/con-tax/properties/cp",
    "https://w3id.org/con-tax/tasks/mwv",
    "https://w3id.org/con-tax/zones/aat-buildings",
    "https://w3id.org/con-tax/zones/aat-buildingSites",
    "https://w3id.org/con-tax/zones/aat-spaces",
    "https://w3id.org/con-tax/zones/aat-storeys",
    "https://w3id.org/con-tax/zones/et-buildings",
    "t424226",
    "https://w3id.org/idsa/core/",
    "http://www.bbc.co.uk/ontologies/bbc",
    "http://www.bbc.co.uk/ontologies/cms",
    "http://www.bbc.co.uk/ontologies/coreconcepts",
    "http://www.bbc.co.uk/ontologies/creativework",
    "http://www.bbc.co.uk/ontologies/provenance",
    "http://www.bbc.co.uk/ontologies/sport",
    "http://www.biopax.org/release/biopax-level3.owl",
    "http://www.essepuntato.it/2008/12/pattern",
    "http://www.essepuntato.it/2012/04/tvc",
    "http://www.linkedmodel.org/schema/dtype",
    "http://www.linkedmodel.org/schema/vaem",
    "http://www.ontology-of-units-of-measure.org/resource/om-2/",
    "http://www.ontologydesignpatterns.org/cp/owl/participation.owl",
    "http://www.ontologydesignpatterns.org/cp/owl/sequence.owl",
    "http://www.ontologydesignpatterns.org/cp/owl/situation.owl",
    "http://www.ontologydesignpatterns.org/cp/owl/timeindexedsituation.owl",
    "http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl",
    "http://www.w3.org/2002/07/owl",
    "http://www.w3.org/2003/06/sw-vocab-status/ns",
    "http://www.w3.org/2004/03/trix/rdfg-1/",
    "http://www.w3.org/2006/gen/ont",
    "http://www.w3.org/2006/time",
    "http://www.w3.org/2006/time-entry",
    "http://www.w3.org/2006/vcard/ns",
    "http://www.w3.org/2008/05/skos-xl",
    "http://www.w3.org/2011/http",
    "http://www.w3.org/ns/auth/acl",
    "http://www.w3.org/ns/oa#",
    "http://www.w3.org/ns/odrl/2/",
    "http://www.w3.org/ns/prov#",
    "http://advene.org/ns/cinelab/ld",
    "http://bimerr.iot.linkeddata.es/def/occupancy-profile#",
    "http://biohackathon.org/resource/faldo",
    "http://brk.basisregistraties.overheid.nl/def/brk",
    "http://brt.basisregistraties.overheid.nl/def/top10nl",
    "http://caressesrobot.org/ontology",
    "http://cedric.cnam.fr/isid/ontologies/PersonLink.owl",
    "http://comicmeta.org/cbo/",
    "http://cookingbigdata.com/linkeddata/ccinstances",
    "http://cookingbigdata.com/linkeddata/ccpricing",
    "http://cookingbigdata.com/linkeddata/ccregions",
    "http://cookingbigdata.com/linkeddata/ccsla",
    "http://data.businessgraph.io/ontology#",
    "http://data.cochrane.org/ontologies/core/",
    "http://data.cochrane.org/ontologies/pico/",
    "http://data.doremus.org/ontology#",
    "http://data.europa.eu/eli/ontology",
    "http://data.europa.eu/esco/model",
    "http://data.lirmm.fr/ontologies/oan",
    "http://data.opendiscoveryspace.eu/lom_ontology_ods.owl",
    "http://data.vlaanderen.be/ns/persoon",
    "http://dataid.dbpedia.org/ns/core#",
    "http://dati.beniculturali.it/cultural-ON/cultural-ON.owl",
    "http://dati.cdec.it/lod/shoah/",
    "http://dati.isprambiente.it/ontology/core#",
    "http://dati.san.beniculturali.it/SAN/",
    "http://datos.gob.es/def/sector-publico/organizacion#",
    "http://def.seegrid.csiro.au/ontology/om/om-lite",
    "http://def.seegrid.csiro.au/ontology/om/sam-lite",
    "http://delicias.dia.fi.upm.es/ontologies/ObjectWithStates.owl",
    "http://dqm.faw.jku.at/ontologies/dsd",
    "http://elite.polito.it/ontologies/eupont.owl",
    "http://gov.genealogy.net/ontology.owl",
    "http://guava.iis.sinica.edu.tw/r4r",
    "http://id.loc.gov/ontologies/bibframe/",
    "http://iflastandards.info/ns/isbd/elements/",
    "http://imgpedia.dcc.uchile.cl/ontology",
    "http://linked.earth/ontology#",
    "http://linkeddata.center/kees/v1",
    "http://linkeddata.finki.ukim.mk/lod/ontology/cfrl#",
    "http://linkeddata.finki.ukim.mk/lod/ontology/tao#",
    "http://linkeddata.finki.ukim.mk/lod/ontology/veo#",
    "http://linkedgeodata.org/ontology",
    "http://lsq.aksw.org/vocab",
    "http://mex.aksw.org/mex-algo",
    "http://mex.aksw.org/mex-core",
    "http://mex.aksw.org/mex-perf",
    "http://ns.inria.fr/ludo",
    "http://ns.inria.fr/ludo/v1/gamemodel#",
    "http://ns.inria.fr/ludo/v1/gamepresentation#",
    "http://ns.inria.fr/ludo/v1/virtualcontext#",
    "http://ns.inria.fr/ludo/v1/xapi",
    "http://ns.inria.fr/munc/",
    "http://ns.inria.fr/nrv",
    "http://ns.inria.fr/provoc",
    "http://onto.dm2e.eu/schemas/dm2e",
    "http://ontologi.es/doap-bugs#",
    "http://ontologi.es/doap-deps#",
    "http://ontology.cybershare.utep.edu/dbowl",
    "http://ontology.cybershare.utep.edu/ELSEWeb/elseweb-data.owl",
    "http://ontology.cybershare.utep.edu/ELSEWeb/elseweb-edac.owl",
    "http://ontology.cybershare.utep.edu/ELSEWeb/elseweb-lifemapper-parameters.owl",
    "http://ontology.cybershare.utep.edu/ELSEWeb/elseweb-lifemapper.owl",
    "http://ontology.cybershare.utep.edu/ELSEWeb/elseweb-modelling.owl",
    "http://ontology.cybershare.utep.edu/ELSEWeb/mappings/elseweb-mappings.owl",
    "http://ontology.eil.utoronto.ca/GCI/Foundation/GCI-Foundation.owl",
    "http://ontology.eil.utoronto.ca/icontact.owl",
    "http://ontology.eil.utoronto.ca/ISO37120.owl",
    "http://ontology.eil.utoronto.ca/open311.owl",
    "http://premon.fbk.eu/ontology/fn",
    "http://d-nb.info/standards/elementset/agrelon#",
    "http://d-nb.info/standards/elementset/dnb#",
    "http://data.ign.fr/def/geofla",
    "http://data.ign.fr/def/ignf",
    "http://data.ign.fr/def/topo#",
    "http://dbpedia.org/ontology/",
    "http://def.seegrid.csiro.au/isotc211/iso19103/2005/basic",
    "http://def.seegrid.csiro.au/isotc211/iso19107/2003/geometry",
    "http://def.seegrid.csiro.au/isotc211/iso19109/2005/feature",
    "http://def.seegrid.csiro.au/isotc211/iso19115/2003/metadata",
    "http://def.seegrid.csiro.au/isotc211/iso19150/-2/2012/basic",
    "http://def.seegrid.csiro.au/isotc211/iso19156/2011/observation",
    "http://def.seegrid.csiro.au/isotc211/iso19156/2011/sampling",
    "http://environment.data.gov.au/def/op",
    "http://labs.mondeca.com/vocab/endpointStatus",
    "http://purl.org/vocommons/voaf",
    "http://culturalis.org/oad#",
    "http://lawd.info/ontology/",
    "http://ns.inria.fr/emoca",
    "http://purl.org/dsnotify/vocab/eventset/",
    "http://purl.org/eis/vocab/daq#",
    "http://purl.org/essglobal/vocab/",
    "http://purl.org/LiMo/0.1",
    "http://purl.org/lobid/lv",
    "http://purl.org/net/po#",
    "http://purl.org/ontology/dso",
    "http://purl.org/ontology/service",
    "http://purl.org/oslo/ns/localgov",
    "http://rdf.insee.fr/def/demo",
    "http://rdf.insee.fr/def/geo",
    "http://rdfs.co/bevon/0.8",
    "http://reegle.info/schema",
    "http://resource.geosciml.org/ontology/timescale/gts",
    "http://resource.geosciml.org/ontology/timescale/thors",
    "http://securitytoolbox.appspot.com/securityAlgorithms#",
    "http://securitytoolbox.appspot.com/securityMain#",
    "http://securitytoolbox.appspot.com/stac#",
    "http://semweb.mmlab.be/ns/oh",
    "http://sensormeasurement.appspot.com/ont/home/homeActivity#",
    "http://vocab.getty.edu/ontology",
    "http://www.w3.org/ns/ssn/",
    "http://betalinkeddata.cbs.nl/def/cbs",
    "http://d-nb.info/standards/elementset/gnd#",
    "http://njh.me/",
    "http://linked.opendata.cz/ontology/ldvm/",
    "http://lod.nl.go.kr/ontology/",
    "http://ns.inria.fr/munc#",
    "http://ns.inria.fr/nrv#",
    "http://ontology.ethereal.cz/irao",
    "http://open-multinet.info/ontology/omn",
    "http://open-multinet.info/ontology/omn-federation",
    "http://open-multinet.info/ontology/omn-lifecycle",
    "http://purl.org/ipo/core",
    "http://purl.org/net/tsn#",
    "http://purl.org/ontology/holding",
    "http://purl.org/qb4olap/cubes",
    "http://purl.org/toco/",
    "http://rdf-vocabulary.ddialliance.org/xkos",
    "http://rdfs.co/juso/0.1",
    "http://rdfs.co/juso/kr/0.1",
    "http://schema.mobivoc.org/",
    "http://sparql.cwrc.ca/ontologies/cwrc",
    "http://swa.cefriel.it/ontologies/botdcat-ap",
    "http://theme-e.adaptcentre.ie/dave#",
    "http://w3id.org/charta77/jup",
    "http://w3id.org/medred/medred#",
    "http://w3id.org/rsp/vocals#",
    "http://w3id.org/um/cbcm/eu-cm-ontology",
    "http://www.arpenteur.org/ontology/Arpenteur.owl",
    "http://www.bl.uk/schemas/bibliographic/blterms",
    "http://www.data-knowledge.org/dk/",
    "http://www.eclap.eu/schema/eclap/",
    "http://www.europeana.eu/schemas/edm/",
    "http://www.irit.fr/recherches/MELODI/ontologies/IoT-Lifecycle",
    "http://www.irit.fr/recherches/MELODI/ontologies/IoT-O",
    "http://www.irit.fr/recherches/MELODI/ontologies/SAN",
    "http://www.lexinfo.net/ontology/2.0/lexinfo",
    "http://www.purl.org/drammar",
    "http://www.purl.org/net/remetca",
    "http://www.sensormeasurement.appspot.com/ont/transport/traffic#",
    "http://www.w3.org/ns/adms",
    "http://www.w3.org/ns/dqv",
    "http://www.w3.org/ns/duv",
    "http://www.w3.org/ns/lemon/decomp",
    "http://www.w3.org/ns/lemon/lime",
    "http://www.w3.org/ns/lemon/ontolex",
    "http://www.w3.org/ns/lemon/synsem",
    "http://www.w3.org/ns/lemon/vartrans",
    "http://www.w3.org/ns/locn",
    "http://www.w3.org/ns/person",
    "http://www.w3.org/ns/r2rml#",
    "http://www.w3.org/ns/regorg",
    "http://www.w3.org/ns/sosa/",
    "https://bmake.th-brandenburg.de/spv#",
    "http://aims.fao.org/aos/geopolitical.owl",
    "http://archivi.ibc.regione.emilia-romagna.it/ontology/eac-cpf/",
    "http://bblfish.net/work/atom-owl/2006-06-06/",
    "http://code-research.eu/ontology/visual-analytics",
    "http://commontag.org/ns#",
    "http://contextus.net/ontology/ontomedia/core/expression#",
    "http://premon.fbk.eu/ontology/nb",
    "http://premon.fbk.eu/ontology/pb",
    "http://premon.fbk.eu/ontology/vn",
    "http://promsns.org/def/agr",
    "http://promsns.org/def/decprov",
    "http://purl.oclc.org/NET/UNIS/fiware/iot-lite#",
    "http://purl.org/cwmo/#",
    "http://purl.org/dita/ns#",
    "http://purl.org/dpn",
    "http://purl.org/eem",
    "http://purl.org/hpi/patchr#",
    "http://purl.org/iot/ontology/fiesta-iot",
    "http://purl.org/iot/ontology/fiesta-priv#",
    "http://purl.org/iot/vocab/iot-taxonomy-lite#",
    "http://purl.org/iot/vocab/m3-lite#",
    "http://purl.org/nemo/gufo#",
    "http://purl.org/net/cartCoord#",
    "http://purl.org/net/dbm/ontology#",
    "http://purl.org/net/hifm/ontology#",
    "http://purl.org/net/soron",
    "http://purl.org/net/step",
    "http://purl.org/net/tsnchange#",
    "http://purl.org/net/VideoGameOntology",
    "http://purl.org/olia/ubyCat.owl",
    "http://purl.org/onto-ocds/ocds",
    "http://purl.org/ontology/ecpo",
    "http://purl.org/prog/",
    "http://purl.org/query/voidext",
    "http://purl.org/reco#",
    "http://purl.org/SemSur/",
    "http://purl.org/umu/uneskos",
    "http://purl.org/voc/summa/",
    "http://purl.org/vsearch/",
    "http://purl.org/wf4ever/ro",
    "http://purl.org/wf4ever/wfdesc",
    "http://purl.org/wf4ever/wfprov",
    "http://purl.org/xapi/ontology#",
    "http://rdfs.co/juso/",
    "http://rdfs.co/juso/kr/",
    "http://reference.data.gov.au/def/ont/dataset",
    "http://reference.data.gov.au/def/ont/iso19160-1-address",
    "http://semanticturkey.uniroma2.it/ns/mdr",
    "http://semweb.mmlab.be/ns/linkedconnections#Ontology",
    "http://semweb.mmlab.be/ns/stoptimes#Ontology",
    "http://semwebquality.org/ontologies/dq-constraints",
    "http://softeng.polito.it/rsctx",
    "http://sparql.sstu.ru:3030/speciality/",
    "http://static.datafoodconsortium.org/ontologies/DFC_BusinessOntology.owl",
    "http://static.datafoodconsortium.org/ontologies/DFC_FullModel.owl",
    "http://static.datafoodconsortium.org/ontologies/DFC_ProductGlossary.owl",
    "http://static.datafoodconsortium.org/ontologies/DFC_TechnicalOntology.owl",
    "http://streamreasoning.org/ontologies/frappe#",
    "http://taxref.mnhn.fr/lod/taxref-ld",
    "http://theme-e.adaptcentre.ie/dave/dave.ttl",
    "http://tour-pedia.org/download/tp.owl",
    "http://vcharpenay.github.io/hto/hto.xml",
    "http://vocab.data.gov/hosp",
    "http://vocab.datex.org/terms#",
    "http://vocab.deri.ie/orca",
    "http://vocab.deri.ie/rooms",
    "http://vocab.resc.info/incident",
    "http://w3id.org/amlo/core",
    "http://w3id.org/vcb/fel#",
    "http://w3id.org/vir#",
    "http://wikiba.se/ontology",
    "http://www.cidoc-crm.org/cidoc-crm/",
    "http://www.daml.org/2001/09/countries/iso-3166-ont",
    "http://www.demcare.eu/ontologies/contextdescriptor.owl",
    "http://www.demcare.eu/ontologies/demlab.owl",
    "http://www.disit.org/km4city/schema",
    "http://www.ebu.ch/metadata/ontologies/ebucore/ebucore",
    "http://www.ebusiness-unibw.org/ontologies/consumerelectronics/v1",
    "http://www.essepuntato.it/2013/03/cito-functions",
    "http://www.essepuntato.it/2013/10/vagueness",
    "http://www.eurocris.org/ontologies/cerif/1.3",
    "http://www.geonames.org/ontology",
    "http://www.gsi.dit.upm.es/ontologies/marl/ns",
    "http://www.gsi.dit.upm.es/ontologies/onyx/ns",
    "http://www.holygoat.co.uk/owl/redwood/0.1/tags/",
    "http://www.ics.forth.gr/isl/MarineTLO/v4/marinetlo.owl",
    "http://www.ics.forth.gr/isl/oae/core",
    "http://www.ics.forth.gr/isl/oncm/core",
    "http://www.ics.forth.gr/isl/VoIDWarehouse/VoID_Extension_Schema.owl",
    "http://www.identity.org/ontologies/identity.owl",
    "http://www.isibang.ac.in/ns/mod",
    "http://www.kanzaki.com/ns/music",
    "http://www.kanzaki.com/ns/whois",
    "http://www.lingvoj.org/semio.rdf",
    "http://www.linklion.org/ontology",
    "http://www.loc.gov/mads/rdf/v1",
    "http://www.loc.gov/premis/rdf/v1",
    "http://www.mindswap.org/2003/owl/geo/geoFeatures20040307.owl",
    "http://www.nanopub.org/nschema",
    "http://www.observedchange.com/moac/ns#",
    "http://www.observedchange.com/tisc/ns#",
    "http://www.oegov.org/core/owl/cc",
    "http://www.oegov.org/core/owl/gc",
    "http://www.ontologydesignpatterns.org/cp/owl/informationrealization.owl",
    "http://www.ontologydesignpatterns.org/cp/owl/semiotics.owl",
    "http://www.ontologydesignpatterns.org/ont/dul/DUL.owl"
]